Documents/упСобытиеМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упСобытиеМониторинга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упОтветыНаЗапросыМобильныйКлиент</xr:Item>
				<xr:Item>InformationRegister.упДатыСобытий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТочки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокПропущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемыВПути</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыСобытияМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗапросовМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упДатыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДатыСобытий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упОтветыНаЗапросыМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упОтветыНаЗапросыМобильныйКлиент</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СобытиеМониторинга</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упИзмененияРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИзмененияРейсов</Name>
			<Comment>Фиксируется необходимость обновить данные о рейсе на мобильном клиенте</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упУведомленияМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упУведомленияМобильныйКлиент</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыСобытияМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыСобытияМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСтатусыЗапросовМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗапросовМобильныйКлиент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненОкончательно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упСобытиеМониторинга/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Дата в документе %1 не заполнена'"), Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,"Объект.Дата",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) И НЕ ТипСобытия = Справочники.упТипыСобытийМониторинга.ОтсутствиеЛицензииНаПодключение Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Транспортное средство в документе %1 не заполнено'"), Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,"Объект.ТранспортноеСредство",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипСобытия)Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Тип события в документе %1 не указан'"), Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,"Объект.ТипСобытия",Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		ДатаЗаписи = ТекущаяДатаСеанса();
		Если НЕ ЗначениеЗаполнено(Статус) Тогда
			Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Новое");
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Ответственный) 
		И Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Обрабатывается") Тогда
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусЗапроса) И Не ЗначениеЗаполнено(КонечнаяДата) Тогда
		КонечнаяДата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		ЭтоЗапросНаПодтверждение = ЗначениеЗаполнено(СтатусЗапроса) И ЗначениеЗаполнено(Рейс) И ЗначениеЗаполнено(ИдентификаторЗадачи);
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упДатыСобытий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", ТранспортноеСредство);
		ЭлементБлокировки.УстановитьЗначение("ТипСобытия", ТипСобытия);
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упОтветыНаЗапросыМобильныйКлиент");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", ИдентификаторТочки);
		
		Если ЭтоЗапросНаПодтверждение Тогда
			Если СтатусЗапроса = Перечисления.упСтатусыЗапросовМобильныйКлиент.Подтвержден Тогда
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упИзмененияРейсов");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
			Иначе
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упУведомленияМобильныйКлиент");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Трекер", Трекер);
				ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
				ЭлементБлокировки.УстановитьЗначение("ИдентификаторЗадачи", ИдентификаторЗадачи);
			КонецЕсли; 
		КонецЕсли; 
		
		упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
		
		// регистр упДатыСобытий
		Движения.упДатыСобытий.Записывать = Истина;
		Движения.упДатыСобытий.Очистить();
		
		Движение = Движения.упДатыСобытий.Добавить();
		Движение.Период               = Дата;
		Движение.ТранспортноеСредство = ТранспортноеСредство;
		Движение.ТипСобытия           = ТипСобытия;
		Движение.Событие              = Ссылка;
		Движение.Рейс                 = Рейс;
		
		Если ЭтоЗапросНаПодтверждение Тогда
			// регистр упОтветыНаЗапросыМобильныйКлиент
			Движения.упОтветыНаЗапросыМобильныйКлиент.Записывать = Истина;
			Движения.упОтветыНаЗапросыМобильныйКлиент.Очистить();
			
			Движение = Движения.упОтветыНаЗапросыМобильныйКлиент.Добавить();
			Движение.Период               = Дата;
			Движение.Рейс                 = Рейс;
			Движение.Идентификатор        = ИдентификаторТочки;
			Движение.СобытиеМониторинга   = Ссылка;
			
			Если ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеЗавершениеРейса Тогда
				ЗаголовокУведомления = НСтр("ru = 'Досрочное завершение рейса'");
			ИначеЕсли ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеУбытиеИзТочкиМаршрута Тогда
				ЗаголовокУведомления = НСтр("ru = 'Досрочное убытие из точки'");
			ИначеЕсли ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаНазначениеТочкиСледующейПоМаршруту Тогда
				ЗаголовокУведомления = НСтр("ru = 'Назначение точки следующей'");
			Иначе
				ЗаголовокУведомления = НСтр("ru = 'Ответ на запрос'");
			КонецЕсли; 
			Если СтатусЗапроса = Перечисления.упСтатусыЗапросовМобильныйКлиент.Подтвержден Тогда
				упИзмененияРейсов = РегистрыСведений.упИзмененияРейсов.СоздатьМенеджерЗаписи();
				упИзмененияРейсов.Рейс = Рейс;
				упИзмененияРейсов.Прочитать();
				упИзмененияРейсов.Рейс = Рейс;
				упИзмененияРейсов.ТребуетсяОбновление = Истина;
				упИзмененияРейсов.Заголовок = ЗаголовокУведомления;
				Если ЗначениеЗаполнено(РезультатОбработки) Тогда
					ТекстУведомления = СтрШаблон(НСтр("ru = 'Запрос подтвержден с комментарием: %1.'"), РезультатОбработки);
				Иначе
					ТекстУведомления = НСтр("ru = 'Запрос подтвержден.'");
				КонецЕсли;
				упИзмененияРейсов.ТекстУведомления = ТекстУведомления;
				упИзмененияРейсов.Записать();
				
			Иначе
				упУведомленияМобильныйКлиент = РегистрыСведений.упУведомленияМобильныйКлиент.СоздатьМенеджерЗаписи();
				упУведомленияМобильныйКлиент.Трекер              = Трекер;
				упУведомленияМобильныйКлиент.Рейс                = Рейс;
				упУведомленияМобильныйКлиент.ИдентификаторЗадачи = ИдентификаторЗадачи;
				упУведомленияМобильныйКлиент.Прочитать();
				
				упУведомленияМобильныйКлиент.Трекер              = Трекер;
				упУведомленияМобильныйКлиент.Рейс                = Рейс;
				упУведомленияМобильныйКлиент.ИдентификаторЗадачи = ИдентификаторЗадачи;
				упУведомленияМобильныйКлиент.Отправлено = Ложь;
				упУведомленияМобильныйКлиент.Заголовок = ЗаголовокУведомления;
				Если СтатусЗапроса = Перечисления.упСтатусыЗапросовМобильныйКлиент.Отклонен Тогда
					Если ЗначениеЗаполнено(РезультатОбработки) Тогда
						ТекстУведомления = СтрШаблон(НСтр("ru = 'Запрос отклонен с комментарием: %1.'"), РезультатОбработки);
					Иначе
						ТекстУведомления = НСтр("ru = 'Запрос отклонен.'");
					КонецЕсли; 
				Иначе	
					Если ЗначениеЗаполнено(РезультатОбработки) Тогда
						ТекстУведомления = СтрШаблон(НСтр("ru = 'Запрос отклонен без права на повторный запрос с комментарием: %1.'"), РезультатОбработки);
					Иначе
						ТекстУведомления = НСтр("ru = 'Запрос отклонен без права на повторный запрос.'");
					КонецЕсли; 
				КонецЕсли; 
				упУведомленияМобильныйКлиент.ТекстУведомления = ТекстУведомления;
				упУведомленияМобильныйКлиент.Записать();
				
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Новое")
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
